public class Task_3 {
    public static void main(String[] args) {
/*
Бинарные файлы – что это?

Бинарный файл (binary в переводе с английского — «двоичный») — это формат представления данных 
с использованием двоичной системы счисления. В отличие от текстовых файлов, 
которые содержат информацию в виде символов (букв, цифр, спецсимволов и т. д.), 
такие форматы хранят информацию как последовательность битов (минимальных единиц информации, состоящих из 0 или 1).
Двоичные файлы могут содержать данные разных типов, такие как числа (целые или с плавающей точкой), 
символы, звуковые или видеофайлы, изображения и многое другое.


Что такое бинарный файл (двоичный файл)
Бинарными называются файлы с данными в двоичном формате, что означает, что каждому значению соответствует 
определенная последовательность битов. Например, для представления числа 7 в такой системе счисления 
требуется 4 бита: 0111. Бинарные файлы также могут содержать заголовки и дополнительные метаданные, 
которые описывают структуру и содержимое файла. Они используются программами для корректной интерпретации 
и обработки данных, записанных в двоичном коде. Некоторые примеры бинарных форматов файлов включают изображения 
(например, BMP, JPEG, PNG), звуковые файлы (например, WAV, MP3), базы данных и т. д.

Строго говоря, любой файл, хранящийся на жестком диске компьютера, является бинарным для самого компьютера, 
так как в конечном счете на аппаратном уровне машина может воспринимать только двоичный код. 
Однако для пользователя файлы бывают либо бинарными, либо текстовыми. 

Рассмотрим основные отличия между ними:

Формат хранения данных. Бинарные файлы содержат информацию в двоичном формате, 
то есть в виде последовательности нулей и единиц. Текстовые файлы, напротив, хранят данные в виде символов,
используя определенную кодировку, такую как ASCII или UTF-8.

Читаемость данных. Одной из важных особенностей бинарных файлов является то, что человек не может 
их воспринимать без специальных программ или средств для их интерпретации. 
Текстовые файлы, с другой стороны, содержат информацию в виде понятного нам текста. 
Ее можно прочитать с помощью любого текстового редактора. 

Объем хранимых данных. Бинарные файлы обеспечивают более компактное хранение данных, 
так как они сохраняют исходный двоичный код без лишней информации. 
Текстовые файлы, в свою очередь, обычно требуют большего объема памяти, так как единицы измерения 
информации имеют более высокую степень диспетчеризации. Кроме того, использование двоичных данных
обеспечивает их более точное представление, так как текстовые форматы могут потерять точность 
при конвертации чисел или при хранении особенных символов.

Обработка данных. Бинарные файлы могут быть менее доступными для работы с данными в сравнении 
с текстовыми файлами. Их содержимое не может быть прочитано или отредактировано обычным текстовым редактором, 
и для работы требуется специализированное программное обеспечение. 
Кроме того, разработчики программ должны быть особенно внимательны при работе с бинарными файлами, 
чтобы избежать проблем совместимости или потери данных. 
Все это делает их более сложными для работы по сравнению с текстовыми файлами.

Типы данных. Бинарные файлы могут хранить любые данные, включая числа, строки, изображения, звуковые файлы 
и другие. Текстовые файлы, с другой стороны, предназначены для хранения текстов, состоящих из букв, цифр, 
общих и специальных символов.

Чтобы компьютер смог работать с текстовым файлом (например, программой, написанной на высокоуровневом языке),
он сначала переводит его в бинарный вид с помощью компилятора.
 */

    }
}
