// Задание № 2
// 1. Продумайте структуру класса Кот. Какие поля и методы будут актуальны для
//приложения, которое является
//а) информационной системой ветеринарной клиники
//б) архивом выставки котов
//в) информационной системой Театра кошек Ю. Д. Куклачёва
//Можно записать в текстовом виде, не обязательно реализовывать в java.

// *************************************
//а) информационной системой ветеринарной клиники
/*
Поля:
    Кличка (name)
    Год рождения (age)
    Порода (bread)
    Номер паспорта (passpot id)
    Окрас (color)
    Владелец (owner)
    Пол (sex)
    Прививки (vactination list)
    История посещений (visit histiry)

Методы:
    Геттеры: getName(), getBreed(), getColor() ...
    Сеттеры: setName(), setBreed(), setColor() ...
    Добавить прививку addVaccination()
    Добавить посещение addVisit()
    ...

 */

// *************************************
//б) архивом выставки котов
/*
Поля:
    Кличка (name)
    Год рождения (age)
    Порода (bread)
    Номер паспорта (passpot id)
    Окрас (color)
    Владелец (owner)
    Пол (sex)
    Награды (awards)

Методы:
    Геттеры: getName(), getBreed(), getColor() ...
    Сеттеры: setName(), setBreed(), setColor() ...
    Добавить награду addAvards()
    Добавить посещение addVisit()
    ...

 */

// *************************************
//в) информационной системой Театра кошек Ю. Д. Куклачёва
/*
Поля:
    Кличка (name)
    Год рождения (age)
    Порода (bread)
    Номер паспорта (passpot id)
    Окрас (color)
    Пол (sex)
    Дрессировщик (trainer)
    Навыки (skills)
    Прививки (vactination list)
    Роли (roles)
    Любимые лакомства (delicacies)

Методы:
    Геттеры: getName(), getBreed(), getColor() ...
    Сеттеры: setName(), setBreed(), setColor() ...
    Добавить роль addRole()
    Добавить навык addSkills()
    Добавить лакомство addDelicacy()
    ...

 */

public class Task_3 {
    public static void main(String[] args) {

    }
}
