// Задача 5.
// На вход программе подаётся некоторое натуральное число N.
// Необходимо вывести на экран числа от 1 до этого введённого числа.
// ***************
// РЕШЕНИЕ:
// ***************

int n = 100;
int i = 1;

while (i <= n)
{
    Console.Write($"\t{i}");
    i++;
}