// Задача 3.
// Даны два целых числа. Вывести на экран бельшее из них.
// Например: 15 и 7
// ***************
// РЕШЕНИЕ:
// ***************


int a = 15;
int b = 7;

if (a > b)
{
    Console.WriteLine(a);
}
else
{
    Console.WriteLine(b);
}