// Домашнее задание. 
// Вычислить значение формулы 𝑎×𝑏 / 𝑐+𝑑, где a,b,c,d – некоторые целые числа.
// Результат вывести на экран.
// ***************
// РЕШЕНИЕ:
// ***************

double a = 14;
int b = 5;
int c = 6;
int d = 7;

double product = a * b;
int sum = c + d;
double result = product / sum;

Console.WriteLine(result);